Repository: mozilla-l10n/mt-training-data
Catalog: am/am_pontoon.tmx
Source language: en_us
Languages: am

source: To know whether this product’s reviews are reliable, check the review quality. It only takes about 60 seconds.
am: የዚህ ምርት ግምገማዎች አስተማማኝ መሆናቸውን ለማወቅ የግምገማውን ጥራት ያረጋግጡ። ወደ 60 ሰከንድ ብቻ ነው የሚወስደው።

source: Toolbar
am: የመሳሪያ አሞሌ

source: Toolbar layout
am: የመሳሪያ አሞሌ አቀማመጥ

source: Tools
am: መሳሪያዎች

source: Top
am: ከላይ

source: To send a tab, sign in to Firefox on at least one other device.
am: ትር ለመላክ ቢያንስ በአንድ ሌላ መሳሪያ ወደ Firefox ይግቡ።

source: Total Cookie Protection isolates cookies to the site you’re on so trackers like ad networks can’t use them to follow you across sites.
am: አጠቃላይ የኩኪ ጥበቃ ኩኪዎችን እርስዎ ካሉበት ድረ-ገጽ ላይ ይነጥላቸዋል ስለዚህ እንደ የማስታወቂያ አውታረ መረቦች ያሉ መከታተያዎች እርስዎን በሁሉም ድረ-ገጾች ላይ ለመከታተል ሊጠቀሙባቸው አይችሉም።

source: To use extensions, enable them in settings or by selecting “%s” below.
am: ቅጥያዎችን ለመጠቀም በቅንብሮች ውስጥ ወይም ከታች “%s” ን በመምረጥ አንቃቸው።

source: Trackers blocked: %d
am: መከታተያዎች ታግደዋል፡ %d

source: Tracking content
am: የመከታተያ ይዘት

source: Tracking Content
am: የመከታተያ ይዘት

source: Tracking Protection has blocked trackers
am: የክትትል ጥበቃ መከታተያዎችን አግዷል

source: Tracking Protection is off for this site
am: የክትትል ጥበቃ ለዚህ ድረ-ገፅ ጠፍቷል

source: Tracking Protection is on
am: የመከታተያ ጥበቃ በርቷል

source: Translate
am: ተርጉም

source: Translated
am: ተተርጉሟል

source: Translated to %1$s
am: ወደ %1$s ተተርጉሟል

source: Translate from
am: ተርጉም ከ

source: Translate page
am: ገጽ ተርጉም

source: Translate page…
am: ገጽ ተርጉም…

source: Translate this page?
am: ይህን ገጽ መተርጎም?

source: Translate to
am: ተርጉም ወደ

source: Translating
am: በመተርጎም ላይ

source: Translating…
am: በመተርጎም ላይ…

source: Translating in Progress
am: በመተርጎም ሂደት ላይ

source: Translation not found, for locale %1$s neither default language %2$s
am: ለአካባቢ %1$sም ሆነ ነባሪ ቋንቋ %2$s ፣ትርጉም አልተገኘም

source: Translation options
am: የትርጉም አማራጮች

source: Translation Options
am: የትርጉም አማራጮች

source: Translation preferences
am: የትርጉም ምርጫዎች

source: Translations
am: ትርጉሞች

source: Translation settings
am: የትርጉም ቅንብሮች

source: Trending on %s
am: በ%s ላይ በመታየት ላይ ያለ

source: Trending Searches
am: በመታየት ላይ ያሉ ፍለጋዎች

source: Try again
am: እንደገና ሞክር

source: Try Again
am: እንደገና ሞክር

source: Try another source language
am: ሌላ ምንጭ ቋንቋ ይሞክሩ

source: Try a recommended extension
am: የሚመከር ቅጥያ ይሞክሩ

source: Try a splash of color
am: የቀለም ነጠብጣብ ይሞክሩ

source: Try connecting on a different device. Check your modem or router. Disconnect and reconnect to Wi-Fi.
am: በሌላ መሣሪያ ላይ ለመገናኘት ይሞክሩ። የእርስዎን ሞደም ወይም ራውተር ይፈትሹ። ግንኙነቱን ያቋርጡ እና ከWi-Fi ጋር እንደገና ያገናኙ።

source: Try our trusted guide to product reviews
am: የእኛን የታመነ የምርት ግምገማዎች መመሪያን ይሞክሩ

source: Try out features and ideas before they’re released to everyone.
am: ለሁሉም ሰው ከመለቀቃቸው በፊት ባህሪያትን እና ሀሳቦችን ይሞክሩ።

source: Try private browsing
am: የግል አሰሳ ይሞክሩ

source: Try private translations in %1$s
am: በ%1$s ውስጥ የግል ትርጉሞችን ይሞክሩ

source: Try restarting add-ons
am: ተጨማሪዎችን እንደገና ለማስጀመር ይሞክሩ

source: Try restarting extensions
am: ቅጥያዎችን እንደገና ለማስጀመር ይሞክሩ

source: Try review checker
am: የግምገማ አረጋጋጭን ይሞክሩት

source: Try the Firefox search widget
am: የFirefox መፈለጊያ መግብርን ይሞክሩ

source: Turn off and %1$s will clear cookies and reload this site. This may sign you out or empty shopping carts.
am: አጥፋ እና %1$s ኩኪዎችን አጽድቶ ይህን ጣቢያ እንደገና ይጭናል። ይህ ሊያስወጣዎት ወይም የግዢ ጋሪዎችን ባዶ ሊያደርግ ይችላል።

source: Turn off Cookie Banner Blocker for %1$s?
am: ለ%1$s የኩኪ ባነር ማገጃ ይጥፋ?

source: Turn off Cookie Banner Reduction for %1$s?
am: ለ%1$s የኩኪ ሰሌዳ ቅነሳ ይጥፋ?

source: Turn off in settings
am: በቅንብሮች ውስጥ አጥፋ

source: Turn off Reader View
am: የአንባቢ እይታን ያጥፉ

source: Turn off review checker
am: የግምገማ አረጋጋጭን ያጥፉ

source: Turn off when a network tells %1$s it shouldn’t use secure DNS. %2$s
am: አውታረ መረብ ለ%1$s ደህንነቱ የተጠበቀ DNS መጠቀም እንደሌለበት ሲነግር ያጥፉ። %2$s

source: Turn off when VPN, parental control, or enterprise policies are active
am: VPN፣ የወላጅ ቁጥጥር ወይም የድርጅት ፖሊሲዎች ንቁ ሲሆኑ ያጥፉ

source: Turn on and %1$s will try to automatically refuse all cookie banners on this site.
am: አብራ እና %1$s በዚህ ጣቢያ ላይ ያሉትን ሁሉንም የኩኪ ባነሮች በራስ ሰር እምቢ ለማለት ይሞክራል።

source: Turn on auto-close
am: በራስ-ሰር መዝጋትን ያብሩ

source: TURN ON AUTO CLOSE
am: ራስ-ሰር ዝጋን ያብሩ

source: Turn on Cookie Banner Blocker for %1$s?
am: ለ%1$s የኩኪ ባነር ማገጃ ይብራ?

source: Turn on Cookie Banner Reduction for %1$s?
am: ለ%1$s የኩኪ ሰሌዳ ቅነሳ ይብራ?

source: Turn on for all sites
am: ለሁሉም ድረ-ገፆች ያብሩ

source: Turn on notifications
am: ማሳወቂያዎችን ያብሩ

source: Turn on Reader View
am: የአንባቢ እይታን ያብሩ

source: Twilight
am: ድንግዝግዝ

source: <ul> <li>Could the item have been renamed, removed, or relocated?</li> <li>Is there a spelling, capitalization, or other typographical error in the address?</li> <li>Do you have sufficient access permissions to the requested item?</li> </ul>
am: <ul> <li>ንጥሉ ሊሰየም፣ ሊወገድ ወይም ወደ ሌላ ቦታ ሊዛወር ይችል ነበር?</li> <li>በአድራሻው ውስጥ የፊደል ግድፈት፣ አጣጣል ወይም ሌላ የአጻጻፍ ስህተት አለ?</li> <li>ለተጠየቀው ንጥል በቂ የመዳረሻ ፍቃድ አለዎት?</li> </ul>

source: <ul> <li>It may have been removed, moved, or file permissions may be preventing access.</li> </ul>
am: <ul> <li>ተወግዷል፣ ተንቀሳቅሷል ወይም የፋይል ፍቃዶች መዳረሻን እየከለከሉ ሊሆን ይችላል።</li> </ul>

source: <ul> <li>Please contact the website owners to inform them of this problem.</li> </ul>
am: <ul> <li>እባክዎ ይህንን ችግር ለማሳወቅ የድረ-ገፁን ባለቤቶች ያነጋግሩ።</li> </ul>

source: <ul> <li>The page you are trying to view cannot be shown because the authenticity of the received data could not be verified.</li> <li>Please contact the website owners to inform them of this problem.</li> </ul>
am: <ul> <li>ሊያዩት የሞከሩት ገጽ ሊታይ አይችልም ምክንያቱም የሚያቀርበው ውሂብ ትክክለኛነት ሊረጋገጥ አልቻለም።</li> <li>እባክዎ ይህንን ችግር ለማሳወቅ የድረ-ገፁን ባለቤቶች ያነጋግሩ።</li> </ul>

source: <ul> <li>The page you are trying to view cannot be shown because this website requires a secure connection.</li> <li>The issue is most likely with the website, and there is nothing you can do to resolve it.</li> <li>You can notify the website’s administrator about the problem.</li> </ul>
am: <ul> <li>ለማየት የሞከሩት ገጽ ሊታይ አይችልም ምክንያቱም ይህ ድረ-ገጽ ደህንነቱ የተጠበቀ ግንኙነት ስለሚያስፈልገው።</li> <li>ጉዳዩ ከድረ-ገፁ ሊሆን ይችላል፣ እና እሱን ለመፍታት እርስዎ ምንም ማድረግ አይችሉም።</li> <li>ስለ ችግሩ የድረ-ገፁን አስተዳዳሪ ማሳወቅ ይችላሉ።</li> </ul>

source: <ul> <li>The site could be temporarily unavailable or too busy. Try again in a few moments.</li> <li>If you are unable to load any pages, check your device’s data or Wi-Fi connection.</li> </ul>
am: <ul> <li>ጣቢያው ለጊዜው የማይገኝ ወይም በጣም ስራ የበዛበት ሊሆን ይችላል። ከጥቂት ጊዜ በኋላ እንደገና ይሞክሩ።</li> <li>ምንም ገጾችን መጫን ካልቻሉ የመሣሪያዎን ውሂብ ወይም የWi-Fi ግንኙነት ያረጋግጡ።</li> </ul>

source: <ul> <li>This could be a problem with the server’s configuration, or it could be someone trying to impersonate the server.</li> <li>If you have connected to this server successfully in the past, the error may be temporary, and you can try again later.</li> </ul>
am: <ul> <li>ይህ በአገልጋዩ ውቅር ላይ ያጋጠመ ችግር ሊሆን ይችላል ወይም ደግሞ አገልጋዩን ለመምሰል የሚሞክር ሰው ሊሆን ይችላል።</li> <li>ከዚህ አገልጋይ ጋር ከዚህ ቀደም በተሳካ ሁኔታ ከተገናኙ ስህተቱ ጊዜያዊ ሊሆን ይችላል እና ቆይተው እንደገና መሞከር ይችላሉ።</li> </ul>

source: <ul> <li>Web addresses are usually written like <strong>http://www.example.com/</strong></li> <li>Make sure that you’re using forward slashes (i.e. <strong>/</strong>).</li> </ul>
am: <ul> <li>የድር አድራሻዎች ብዙውን ጊዜ እንደ <strong>http://www.example.com/</strong></li> ይጻፋሉ <li>እዝባሮችን እየተጠቀሙ መሆንዎን ያረጋግጡ (ማለትም <strong>/</strong>)።</li> </ul>

source: Unable to connect
am: መገናኘት አልተቻለም

source: Unable to generate PDF
am: PDF መፍጠር አልተቻለም

source: Unable to open %1$s
am: %1$sን መክፈት አልተቻለም

source: Unable to print
am: ማተም አልተቻለም

source: Unable to print this page
am: ይህን ገጽ ማተም አልተቻለም

source: Unable to save login
am: መግባትን ማስቀመጥ አልተቻለም

source: Unable to send
am: መላክ አልተቻለም

source: Undo
am: ቀልብስ

source: UNDO
am: ቀልብስ

source: Unexpected response from server
am: ከሰርቨር ያልተጠበቀ ምላሽ

source: Unfortunately, we can’t check the review quality for certain types of products. For example, gift cards and streaming video, music, and games.
am: እንደ አለመታደል ሆኖ ለተወሰኑ የምርት ዓይነቶች የግምገማውን ጥራት ማረጋገጥ አንችልም። ለምሳሌ፣ የስጦታ ካርዶች እና የቪዲዮ፣ ሙዚቃ እና ጨዋታዎች ሥርጭት።

source: Unknown Protocol
am: ያልታወቀ ፕሮቶኮል

source: unknown time
am: ያልታወቀ ጊዜ

source: Unlock
am: ክፈት

source: Unlock %1$s
am: %1$sን ይክፈቱ

source: Unlock private tabs
am: የግል ትሮችን ይክፈቱ

source: Unlock to use saved payment methods
am: የተቀመጡ የመክፈያ ዘዴዎችን ለመጠቀም ይክፈቱ

source: Unlock to use stored credit card information
am: የተከማቸ የክሬዲት ካርድ መረጃን ለመጠቀም ይክፈቱ

source: Unlock to view your saved cards
am: የተቀመጡ ካርዶችዎን ለማየት ይክፈቱ

source: Unlock to view your saved logins
am: የተቀመጡ መግቢያዎችዎን ለማየት ይክፈቱ

source: Unlock to view your saved passwords
am: ያስቀመጧቸውን የይለፍ ቃሎች ለማየት ቁልፉን ይክፈቱ

source: Unlock your device
am: መሣሪያዎን ይክፈቱ

source: Unreliable reviews
am: የማይታመኑ ግምገማዎች

source: Unreliable reviews removed
am: የማይታመኑ ግምገማዎች ተወግደዋል

source: Unreliable reviews. We believe the reviews are likely fake or from biased reviewers.
am: የማይታመኑ ግምገማዎች። ግምገማዎቹ የሐሰት ወይም አድሏዊ ከሆኑ ገምጋሚዎች ናቸው ብለን እናምናለን።

source: Unsafe File Type
am: ደህንነቱ ያልተጠበቀ የፋይል አይነት

source: Unverified scripts can pose security and privacy risks. Only run scripts from extensions or sources you trust.
am: ያልተረጋገጡ ስክሪፕቶች የደህንነት እና የግላዊነት አደጋዎችን ሊያስከትሉ ይችላሉ። ስክሪፕቶችን ከቅጥያዎች ወይም ከምታምኗቸው ምንጮች ብቻ አሂድ።

source: Unwanted site issue
am: የማይፈለግ የድረ-ገፅ ጉዳይ

source: Update
am: አዘምን

source: Update before March 14
am: ከማርች 14 በፊት ያዘምኑ

source: Update card expiration date?
am: የካርድ ማብቂያ ቀን ይዘምን?

source: Update now
am: አሁን አዘምን

source: Update password?
am: የይለፍ ቃል ይዘምን?

source: Update recommended
am: ማዘመን ይመከራል

source: Updater Information
am: የዝማኔ መረጃ

source: Update this login?
am: ይህ መግቢያ ይዘምን?

source: Update username?
am: የተጠቃሚ ስም ይዘምን?

source: Update your Firefox browser
am: የFኢረፎሽ ማሰሻዎን ያዘምኑ

source: Upload
am: ጫን

source: Upload files?
am: ፋይሎች ይጫኑ?

source: URL copied
am: URL ተቀድቷል

source: URL copied.
am: URL ተቀድቷል።

source: URL copied to clipboard
am: URL ወደ ቅንጥብ ሰሌዳ ተቀድቷል

source: URL must start with “https://”
am: URL በ "https://" መጀመር አለበት

source: URL to use for search
am: ለፍለጋ የሚጠቀሙት URL

source: Usage and technical data
am: የአጠቃቀም እና ቴክኒካዊ ውሂብ

source: Usage data
am: የአጠቃቀም ውሂብ

source: Use %1$s as a login provider
am: %1$sን እንደ መለያ አቅራቢ ይጠቀሙ

source: Use a local provider, if possible. %1$s
am: ከተቻለ የአካባቢ አቅራቢን ይጠቀሙ። %1$s

source: Use email instead
am: በምትኩ ኢሜይል ተጠቀም

source: Use password
am: የይለፍ ቃል ተጠቀም

source: Username
am: የተጠቃሚ ስም

source: Username copied to clipboard
am: የተጠቃሚ ስም ወደ ቅንጥብ ሰሌዳ ተቀድቷል

source: Username required
am: የተጠቃሚ ስም ያስፈልጋል

source: Username updated
am: የተጠቃሚ ስም ዘምኗል

source: Use saved card
am: የተቀመጠ ካርድ ተጠቀም

source: Use screen lock to hide tabs in private browsing
am: በግል አሰሳ ውስጥ ትሮችን ለመደበቅ የማያ ገጽ መቆለፊያን ይጠቀሙ

source: Use strong password
am: ጠንካራ የይለፍ ቃል ይጠቀሙ

source: Use strong password?
am: ጠንካራ የይለፍ ቃል ይጠቀሙ?

source: Use strong password: %1$s
am: ጠንካራ የይለፍ ቃል ይጠቀሙ:- %1$s

source: Use the provider you select
am: የመረጡትን አቅራቢ ይጠቀሙ

source: Use your default DNS resolver if there is a problem with the secure DNS provider
am: ደህንነቱ በተጠበቀው የ DNS አቅራቢ ላይ ችግር ካለ ነባሪውን የ DNS መፍታት ይጠቀሙ

source: Using the power of %1$s by Mozilla, we help you avoid biased and inauthentic reviews. Our AI model is always improving to protect you as you shop. %2$s
am: በሞዚላ የ%1$s ኃይልን በመጠቀም አድሎአዊ እና ትክክለኛ ያልሆኑ ግምገማዎችን እናግዝዎታለን። ሲገዙ እርስዎን ለመጠበቅ የእኛ AI ሞዴል ሁልጊዜ እየተሻሻለ ነው። %2$s

source: Valid hostname required
am: ትክክለኛ የአስተናጋጅ ስም ያስፈልጋል

source: Verification failed
am: ማረጋገጥ አልተሳካም

source: Verified By: %1$s
am: አረጋጋጭ:- %1$s

source: Verified by %s
am: በ%s የተረጋገጠ

source: Very dissatisfied
am: በጣም አልረካም

source: Very Dissatisfied
am: በጣም አልረካም

source: Very satisfied
am: በጣም ረክቻለሁ

source: Very Satisfied
am: በጣም ረክቻለሁ

source: Video isn’t playing or loading
am: ቪዲዮው እየተጫወተ ወይም እየተጫነ አይደለም

source: Videos
am: ተንቀሳቃሽ-ምስሎች

source: View a list of tabs from your other devices.
am: ከሌሎች መሳሪያዎችዎ የትሮች ዝርዝር ይመልከቱ።

source: View options
am: አማራጮችን ይመልከቱ

source: View recently closed tabs
am: በቅርብ ጊዜ የተዘጉ ትሮችን ይመልከቱ

source: View tabs with fingerprint, face unlock, or PIN.
am: በጣት አሻራ፣ በመልክ መክፈቻ ወይም በፒን ትሮችን ይመልከቱ።

source: View tabs with your fingerprint, PIN, or face unlock.
am: በጣት አሻራ፣ ፒን ወይም በመልክ መክፈቻ ትሮችን ይመልከቱ።

source: Voice search
am: የድምጽ ፍለጋ

source: Wallpaper Item: %1$s
am: ልጣፍ ንጥል፡- %1$s

source: Wallpapers
am: ልጣፎች

source: Wallpaper updated!
am: ልጣፍ ዘምኗል!

source: We assign each product’s reviews a <b>letter grade</b> from A to F.
am: የእያንዳንዱን ምርት ግምገማዎች በ<b>ፊደል ደረጃ</b> ከሀ እስከ ረ እንመድባለን።

source: Web address must contain "https://" or "http://"
am: የድር አድራሻ "https://" ወይም "http://" መያዝ አለበት

source: Web address not valid.
am: የድር አድራሻ ልክ አይደለም።

source: We believe there’s a mix of reliable and unreliable reviews.
am: አስተማማኝ እና የማይታመኑ ግምገማዎች ድብልቅ እንዳለ እናምናለን።

source: We believe the reviews are unreliable.
am: ግምገማዎቹ የማይታመኑ ናቸው ብለን እናምናለን።

source: We believe the reviews to be reliable.
am: ግምገማዎቹ አስተማማኝ ናቸው ብለን እናምናለን።

source: Website
am: ድረ-ገፅ

source: website activity
am: የድር ጣቢያ እንቅስቃሴ

source: website content
am: የድር ጣቢያ ይዘት

source: We can’t auto refuse cookie pop-ups on this site right now.
am: በአሁኑ ሰዓት በዚህ ጣቢያ ላይ ብቅ-ባዮችን በራስ-ሰር መቃወም አንችልም።

source: We can’t check these reviews
am: እነዚህን ግምገማዎች ማረጋገጥ አንችልም

source: We download partial languages to keep translations private.
am: ትርጉሞችን የግል ለማድረግ ከፊል ቋንቋዎችን እናወርዳለን።

source: We download partial languages to your cache to keep translations private.
am: ትርጉሞችን የግል ለማድረግ ከፊል ቋንቋዎችን ወደ መሸጎጫዎ እናወርዳለን።

source: Welcome to a better internet
am: ወደ ተሻለ በይነ-መረብ እንኳን በደህና መጡ

source: Welcome to a more personal internet
am: ወደ የግል በይነመረብ እንኳን በደህና መጡ

source: Welcome to Firefox
am: ወደ Firefox እንኳን በደህና መጡ

source: We love keeping you safe
am: ደህንነትዎን መጠበቅ እንወዳለን

source: We‘re currently building support for an initial selection of Recommended Extensions.
am: በአሁኑ ጊዜ ለሚመከሩ ቅጥያዎች የመጀመሪያ ምርጫ ድጋፍን እየገነባን ነው።

source: We’re working to resolve the issue. Please check back soon.
am: ችግሩን ለመፍታት እየሰራን ነው። እባክዎ በቅርቡ ተመልሰው ያረጋግጡ።

source: We should have info about this product’s reviews within 24 hours. Please check back.
am: በ24 ሰዓታት ውስጥ ስለዚህ ምርት ግምገማዎች መረጃ ሊኖረን ይገባል። እባክዎን ተመልሰው ያረጋግጡ።

source: We use AI technology from %s by Mozilla to check the reliability of product reviews. This will only help you assess review quality, not product quality.
am: የምርት ግምገማዎችን አስተማማኝነት ለማረጋገጥ AI ቴክኖሎጂን ከ%s በMozilla እንጠቀማለን። ይህ እርስዎ የግምገማ ጥራትን ብቻ እንጂ የምርት ጥራትን እንዲገመግሙ አይረዳወትም።

source: What do you think about %1$s?
am: ስለ%1$s ምን ያስባሉ?

source: What’s blocked by custom tracking protection
am: በብጁ የመከታተያ ጥበቃ የታገደው

source: What’s blocked by standard tracking protection
am: በመደበኛ የመከታተያ ጥበቃ የታገደው

source: What’s blocked by strict tracking protection
am: በጥብቅ የመከታተያ ጥበቃ የታገደው

source: What’s broken?
am: ምኑ ተበላሽቷል?

source: What’s broken? (optional)
am: ምኑ ተበላሽቷል? (አማራጭ)

source: What’s new
am: ምን አዲስ ነገር አለ

source: What’s new in %s
am: በ%s ውስጥ ምን አዲስ ነገር አለ

source: When this product has more reviews, we’ll be able to check their quality.
am: ይህ ምርት ተጨማሪ ግምገማዎች ሲኖረው ጥራታቸውን ማረጋገጥ እንችላለን።

source: When you’re signed in and synced, you’re safer. Firefox encrypts your passwords, bookmarks, and more.
am: በመለያ ሲገቡ እና ስያመሳስሉ የበለጠ ደህንነት ይኖርዎታል። Firefox የእርስዎን የይለፍ ቃላት፣ ዕልባቶች እና ሌሎችንም ያመሰጥራል።

source: When you share how you discovered Firefox and that you use it, you help us introduce our browser to more people.
am: ፋየርፎክስን እንዴት እንዳገኙ እና እንደምትጠቀሙበት ሲያካፍሉ፣ አሳሽችንን ለብዙ ሰዎች እንድናስተዋውቅ ይረዱናል።

source: Who might be able to see my activity?
am: የእኔን እንቅስቃሴ ማን ማየት ይችላል?

source: With Firefox on your home screen, you’ll have easy access to the privacy-first browser that blocks cross-site trackers.
am: Firefox በመነሻ ማያ ገፅ ሲኖር፣ ድረ-ገፅ ተሻጋሪ መከታተያወችን የሚያግድ ፣ ግላዊነትን የሚያስቀድም አሳሽ በቀላሉ ማግኘት ይችላሉ።

source: Would you like to leave %s to view this content?
am: ይህን ይዘት ለማየት %sን መተው ይፈልጋሉ?

source: Xiaomi devices may need extra permissions to add shortcuts to the home screen. Please check your settings.
am: የXiaomi መሳሪያዎች ወደ መነሻ ስክሪን አቋራጮችን ለመጨመር ተጨማሪ ፈቃዶች ያስፈልጉ ይሆናል። እባክዎን ቅንብሮችዎን ያረጋግጡ።

source: Yesterday
am: ትላንት

source: Yes, try it
am: አዎ፣ ይሞክሩት

source: You can easily add this website to your device’s Home screen to have instant access and browse faster with an app-like experience.
am: ፈጣን መዳረሻ እንዲኖርዎት እና መተግበሪያ በሚመስል ልምድ በፍጥነት ለማሰስ ይህን ድረ-ገጽ በቀላሉ ወደ መሳሪያዎ መነሻ ማያ ገጽ ማከል ይችላሉ።

source: You can set %1$s to automatically open links in apps.
am: በመተግበሪያዎች ውስጥ አገናኞችን በራስ-ሰር ለመክፈት %1$sን ማዘጋጀት ይችላሉ።

source: You control when to use secure DNS and choose your provider.
am: ደህንነቱ የተጠበቀ DNS መቼ መጠቀም እንዳለቦት ይቆጣጠራሉ እና አቅራቢዎን ይምረጡ።

source: You control your data
am: ውሂብዎን ይቆጣጠራሉ

source: You don’t have any tabs open in Firefox on your other devices.
am: በሌሎች መሳሪያዎችዎ ላይ በፋየርፎክስ ውስጥ ምንም የተከፈቱ ትሮች የሉዎትም።

source: You have an unsent crash report related to crashes being investigated. Sending it will help us improve %1$s. Closing this notification will ignore this report.
am: እየተመረመሩ ካሉ ብልሽቶች ጋር የተያያዘ ያልተላከ የብልሽት ሪፖርት አለዎት። እሱን መላክ %1$sን እንድናሻሽል ይረዳናል። ይህን ማሳወቂያ መዝጋት ይህንን ሪፖርት ችላ ይለዋል።

source: You have extensions installed, but not enabled
am: የተጫኑ ቅጥያዎች አሉዎት፣ ግን አልነቁም

source: You have unsent crash reports (%1$d) related to crashes being investigated. Sending them will help us improve %2$s. Closing this notification will ignore these reports.
am: እየተመረመሩ ካሉ ብልሽቶች ጋር የተያያዙ ያልተላኩ የብልሽት ሪፖርቶች አሉዎት (%1$d) ። እነሱን መላክ %2$sን እንድናሻሽል ይረዳናል። ይህን ማሳወቂያ መዝጋት እነዚህን ሪፖርቶች ችላ ይላቸዋል።

source: You’ll be logged out of most sites
am: ከአብዛኛዎቹ ድረ-ገፆች ዘግተው እንዲወጡ ይደረጋሉ

source: You’ll see fewer cookie requests
am: ያነሱ የኩኪ ጥያቄዎችን ያያሉ

source: You’ll see occasional ads for relevant products. All ads must meet our review quality standards. %s
am: ለሚመለከታቸው ምርቶች አልፎ አልፎ ማስታወቂያዎችን ያያሉ። ሁሉም ማስታወቂያዎች የግምገማ የጥራት መስፈርቶቻችንን ማሟላት አለባቸው። %s

source: You’ll see occasional ads for relevant products. We only advertise products with reliable reviews. %s
am: ለሚመለከታቸው ምርቶች አልፎ አልፎ ማስታወቂያዎችን ያያሉ። ምርቶችን የምናስተዋውቀው በታማኝ ግምገማዎች ብቻ ነው። %s

source: You may want to block access if it's not clear why %s needs this data.
am: %s ለምን ይህ ውሂብ እንደሚያስፈልገው ግልጽ ካልሆነ መዳረሻን ማገድ ይፈልጉ ይሆናል።

source: Your connection is not secure.
am: ግንኙነትዎ ደህንነቱ የተጠበቀ አይደለም።

source: You’re 4 steps in. Only 2 more to go!
am: 4 ደረጃዎች ገብተዋል። 2 ተጨማሪ ብቻ ነው የቀረው!

source: You’re halfway there! Three steps finished and 3 to go.
am: ግማሽ መንገድ ላይ ነዎት! ሶስት እርከኖች ተጠናቅቀዋል እና 3 ይቀርዎታል።

source: You’re on an older version of Firefox
am: የቆየ የFirefox ስሪት ላይ ነዎት

source: You’re protected. If we spot something, we’ll let you know.
am: እርስዎ ጥበቃ ይደረግልዎታል። የሆነ ነገር ካየን፣ እናሳውቅዎታለን።

source: Your open tabs will be shown here.
am: የእርስዎ ክፍት ትሮች እዚህ ይታያሉ።

source: Your private tabs will be shown here.
am: የእርስዎ የግል ትሮች እዚህ ይታያሉ።

source: Your report was sent
am: ማሳወቂያዎ ተልኳል

source: Your tabs are syncing! Pick up where you left off on your other device.
am: የእርስዎ ትሮች እየተመሳሰሉ ናቸው! በሌላኛው መሣሪያዎ ላይ ካቆሙበት ይቀጥሉ።

source: You turned off protections
am: ጥበቃዎችን አጥፍተዋል

source: You’ve completed 2 out of 6 steps. Great progress!
am: ከ6 ደረጃዎች 2ቱን ጨርሰዋል። ታላቅ እድገት!

source: You’ve completed all 3 steps. Enjoy the speed, privacy, and security of %1$s.
am: ሁሉንም 3 ደረጃዎች ጨርሰዋል። በ%1$s ፍጥነት፣ ግላዊነት እና ደህንነት ይደሰቱ።

source: You’ve completed all 6 setup steps. Enjoy the speed, privacy, and security of %1$s.
am: ሁሉንም 6 የማዋቀር ደረጃዎች ጨርሰዋል። በ%1$s ፍጥነት፣ ግላዊነት እና ደህንነት ይደሰቱ።

source: You’ve enabled HTTPS-Only Mode for enhanced security, and a HTTPS version of <em>%1$s</em> is not available.
am: ለተሻሻለ ደህንነት HTTPS-only ሁነታን አንቅተዋል፣ እና የ<em>%1$s</em> HTTPS ስሪት የለም።

source: Zip
am: ዚፕ

source: Zoom on all websites
am: በሁሉም ድረ-ገጾች ላይ አጉላ

source: %1$s also uses blocklists provided by Disconnect, Inc. as separate and independent works under the <a href="%2$s">GNU General Public License v3</a>, and available <a href="%3$s">here</a>.
am: %1$s በተጨማሪም በ Disconnect, Inc. የሚቀርቡ የእግድ ዝርዝሮችን በ<a href="%2$s">በጂኤንዩ አጠቃላይ የህዝብ ፍቃድ v3</a> ስር እንደ ገለልተኛ ስራዎች ይጠቀማል፤ እና <a href="%3$s">እዚህ</a> ይገኛል።

source: %1$s can try to automatically reject cookie requests. If a reject option isn’t available, %1$s may accept all cookies to dismiss the banner.
am: %1$s የኩኪ ጥያቄዎችን በራስ ሰር ውድቅ ለማድረግ መሞከር ይችላል። ውድቅ የማድረግ አማራጭ ከሌለ %1$s ባነርን ለማሰናበት ሁሉንም ኩኪዎች ሊቀበል ይችላል።

source: %1$s finished
am: %1$s ተጠናቅቋል

source: %1$s is free and open source software made by Mozilla and other contributors.
am: %1$s ሞዚላ እና ሌሎች አስተዋፅዖ አድራጊዎች የተሰሩ ነጻ እና ግልጽ ምንጭ ሶፍትዌሮች ናቸው

source: %1$s is made available to you under the terms of the <a href="%2$s">Mozilla Public License</a> and other open source licenses.
am: %1$s ለእርስዎ የቀረበው በ<a href="%2$s">ሞዚላ የሕዝብ ፈቃድ</a> እና ሌሎች የክፍት ምንጭ ፈቃዶች ውል መሠረት ነው።

source: %1$s isn’t like other browsers
am: %1$s እንደ ሌሎች አሳሾች አይደለም

source: %1$s tries to reject cookie requests to dismiss annoying cookie banners. Manage cookie banner preferences in %2$s.
am: %1$s የሚረብሹ የኩኪ ባነሮችን ለማሰናበት የኩኪ ጥያቄዎችን ውድቅ ለማድረግ ይሞክራል። የኩኪ ባነር ምርጫዎችን በ%2$s ውስጥ ያስተዳድሩ።

source: %1$s tries to reject cookie requests to dismiss annoying cookie banners. Manage cookie banner preferences in settings.
am: %1$s የሚረብሹ የኩኪ ባነሮችን ለማሰናበት የኩኪ ጥያቄዎችን ውድቅ ለማድረግ ይሞክራል። የኩኪ ባነር ምርጫዎችን በቅንብሮች ውስጥ ያስተዳድሩ።

source: %1$s tries to use an HTTPS connection whenever possible for more security. <a href="%2$s">Learn more</a> <br/><br/> Change this setting in Settings > Privacy &amp; Security > Security.
am: %1$s ለበለጠ ደህንነት በተቻለ መጠን የHTTPS ግንኙነት ለመጠቀም ይሞክራል። <a href="%2$s">የበለጠ ለመረዳት</a> <br/><br/> ይህን ቅንብር በቅንብሮች> ግላዊነት &amp; ደህንነት > ደህንነት።

source: %1$s will send what you type in the address bar to your search engine
am: %1$s በአድራሻ አሞሌው ላይ የሚተይቡትን ወደ የፍለጋ ፍርግምዎ ይልካል

source: About %1$s, help
am: ስለ %1$s፣ እገዛ

source: Add and manage custom autocomplete URLs.
am: አክል ወይም አደራጅ ብጁ ራስ-አጠናቅቅ URLs

source: + Add another search engine
am: + ሌላ የፍለጋ ፕሮግራም አክል

source: Add another search engine
am: ሌላ የፍለጋ ፍርግም አክል

source: + Add custom URL
am: + ብጁ አክል URL

source: Add custom URL
am: ብጁ አክል URL

source: Additional source code for %1$s is available under various other free and open source <a href="%2$s">licenses</a>.
am: የ%1$s ተጨማሪ ምንጭ ኮድ በተለያዩ ነፃ እና ክፍት ምንጭ <a href="%2$s">ፈቃዶች</a> ስር ይገኛል።

source: Add link to autocomplete
am: ወደ ራስ-አጠናቅቅ አገናኝ አክል

source: Add shortcuts to your home screen
am: ወደ መነሻ ማያ ገጽዎ አቋራጮችን ያክሉ

source: Add to Shortcuts
am: ወደ አቋራጭ ጨምር

source: Add URL
am: ዩአርኤል አክል

source: Add widget to home screen
am: መግብርን ወደ መነሻ ማያ ገጽ ያክሉ

source: Advertising
am: ማስታወቂያ

source: Analytics
am: ትንታኔ

source: An installed search engine is already using that name.
am: አንድ የተጫነ የፍለጋ ፍርግም አስቀድሞ ያንን ስም እየተጠቀመ ነው።

source: As a private browser, we never save and cannot restore this tab.
am: እንደ የግል አሳሽ፣ ይህን ትር በፍፁም አናስቀምጥም እና ወደነበረበት መመለስ አንችልም።

source: Autocomplete URLs for sites you use most Long-press any URL in the address bar
am: በብዛት ለሚጠቀሙባቸው ድረ-ገፆች ዩአርኤሎችን በራስ ሰር ያጠናቅቁ በአድራሻ አሞሌው ውስጥ ማንኛውንም ዩአርኤል በረጅሙ ይጫኑ

source: Automatically attempts to connect to sites using the HTTPS encryption protocol for increased security.
am: ለበለጠ ደህንነት የ HTTPS ምስጠራ ፕሮቶኮልን በመጠቀም ከድረ-ገፆች ጋር በራስ-ሰር ለመገናኘት ይሞክራል።

source: Automatic private browsing. Browse. Erase. Repeat.
am: አውቶማቲክ የግል አሰሳ ያስሱ. ደምስስ. ድገም.

source: Block 3rd-party cookies only
am: የሶስተኛ ወገን ኩኪዎችን ብቻ አግድ

source: Block 3rd-party tracker cookies only
am: የሶስተኛ ወገን መከታተያ ኩኪዎችን ብቻ አግድ

source: Block ad trackers
am: የማስታወቂያ መከታተያዎችን አግድ

source: Block analytic trackers
am: መተንተኛ ተቆጣጣሪዎች ያግዱ

source: Block cookies
am: ኩኪዎችን አግድ

source: Block Cookies
am: ኩኪዎችን አግድ

source: Block cross-site cookies
am: ከድረ-ገፅ ድረ-ገፅ የሚከታተሉ ኩኪዎችን አግድ

source: Block JavaScript
am: ጃቫ-ስክሪፕት አግድ

source: Block other content trackers
am: ሌሎች የይዘት መከታተያዎችን ያግዱ

source: Block potentially dangerous and deceptive sites
am: አደገኛ ሊሆኑ የሚችሉ እና አታላይ ድረ-ገፆችን አግድ

source: Block reported deceptive and attack sites, malware sites, and unwanted software sites.
am: ሪፖርት የተደረጉ የማታለል እና የጥቃት ድረ-ገፆችን፣ የማልዌር ድረ-ገፆችን እና ያልተፈለጉ የሶፍትዌር ድረ-ገፆችን አግድ።

source: Block social trackers
am: ማህበራዊ ሚዲያ መከታተያዎችን አግድ

source: Block Web fonts
am: የድር ቅርጸ ቁምፊዎችን አግድ
